<script setup>
import { ref } from 'vue';

defineProps({
   msg: String,
});
</script>

<template>
   <section id="burger">
      <button type="button">
         <svg width="18" height="12" viewBox="0 0 18 12" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path
               d="M0 11C0 11.5523 0.447715 12 1 12H17C17.5523 12 18 11.5523 18 11C18 10.4477 17.5523 10 17 10H1C0.447716 10 0 10.4477 0 11ZM0 6C0 6.55228 0.447715 7 1 7H17C17.5523 7 18 6.55228 18 6C18 5.44772 17.5523 5 17 5H1C0.447716 5 0 5.44772 0 6ZM1 0C0.447716 0 0 0.447715 0 1C0 1.55228 0.447715 2 1 2H17C17.5523 2 18 1.55228 18 1C18 0.447715 17.5523 0 17 0H1Z"
               fill="#F0C6FB"
            />
         </svg>
         <!-- <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M17.0936 2.71929C17.5942 2.21868 17.5942 1.40703 17.0936 0.906428C16.593 0.405822 15.7813 0.405822 15.2807 0.906428L9 7.18714L2.71929 0.906429C2.21868 0.405822 1.40703 0.405822 0.906428 0.906428C0.405822 1.40703 0.405822 2.21868 0.906428 2.71929L7.18714 9L0.906429 15.2807C0.405822 15.7813 0.405822 16.593 0.906428 17.0936C1.40703 17.5942 2.21868 17.5942 2.71929 17.0936L9 10.8129L15.2807 17.0936C15.7813 17.5942 16.593 17.5942 17.0936 17.0936C17.5942 16.593 17.5942 15.7813 17.0936 15.2807L10.8129 9L17.0936 2.71929Z" fill="#F0C6FB"/>
         </svg> -->
      </button>
      <ul class="burger-list">
         <li>
            <a href="#main">Главная</a>
         </li>
         <li>
            <a href="#features">Преимущества</a>
         </li>
         <li>
            <a href="#examples">Примеры продукции</a>
         </li>
         <li>
            <a href="#about">О нас</a>
         </li>
         <li>
            <a href="#reviews">Отзывы</a>
         </li>
         <li>
            <a href="#contacts">Контакты</a>
         </li>
      </ul>
   </section>
</template>

<style scoped></style>
